Revit 2027 API
ExporterIFCUtils.CreateGUID Method
 Creates a randomized GUID.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string CreateGUID()
Public Shared Function CreateGUID As String
public:
static String^ CreateGUID()
static member CreateGUID : unit -> string
Return Value
String
 The guid string.
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace